Revit 2027 API
ParameterTypeId.WallAlignKeyRefParam Property
 "Location line to align"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallAlignKeyRefParam { get; }
Public Shared ReadOnly Property WallAlignKeyRefParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallAlignKeyRefParam {
	ForgeTypeId^ get ();
}
static member WallAlignKeyRefParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace